/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 5.1
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92
 * @Date: 30.03.2017
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация цифро-аналогового преобразователя
  DAC_Init();

  // Пустой цикл для работы ядра
  while(1);
}
