/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 6.4
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 18.07.2018
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация аналого-цифрового преобразователя
  ADC_Init();

  // Инициализация прямого доступа к памяти
  DMA_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
