/*******************************************************************************
 * @File: rtos.h
 * @Author: Milandr, L.
 * @Project: Sample 6.1
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 15.05.2017
 * @Purpose: Управление операционной системой реального времени
 *******************************************************************************/

#ifndef RTOS_H
#define RTOS_H

// Подключение заголовочных файлов модулей проекта
#include "link.h"

// Параметры очереди сообщений
#define MSG_AMOUNT 1  // Максимальное количество сообщений в очереди
#define MSG_SIZE   2  // Максимальный размер одного сообщения (в байтах)

// Идентификатор очереди сообщений
extern osMessageQueueId_t MsgQueId_ADC;

// Прототипы функций
void RTOS_Init(void);  // Инициализация операционной системы реального времени

#endif
