/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 3.2
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 15.03.2019
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация аппаратного таймера
  TIMER_Init();

  // Инициализации порта для работы с кнопкой
  BTN_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
