/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 3.1
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 13.03.2019
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация порта для работы со светодиодами
  LED_Init();

  // Инициализация аппаратного таймера
  TIMER_Init();

  // Пустой цикл для работы ядра
  while(1);
}
