/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 10.1
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 19.05.2017
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация интерфейса SPI
  SPI_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
