/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 2.3
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 05.04.2017
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация порта для работы со светодиодами
  LED_Init();

  // Инициализация портов для работы с кнопками
  BTN_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Отображение меню
  LCD_MenuInit();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
