/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 11.1
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 08.02.2017
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация модуля I2C
  I2C_Init();

  // Инициализация порта для работы с кнопкой
  BTN_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
