/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 2.2
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 07.04.2017
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация светодиодов
  LED_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
