/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 7.2
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 10.12.2018
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация контроллера DMA
  DMA_Init();

  // Инициализация таймера в режиме широтно-импульсной модуляции
  TIMER_Init();

  // Инициализация аналого-цифрового преобразователя
  ADC_Init();

  // Инициализация ОСРВ
  RTOS_Init();
}
