/*******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Sample 3.3
 * @Microcontroller: 1986VE92U
 * @Device: Evaluation Board For MCU 1986VE92U
 * @Date: 12.07.2017
 * @Purpose: Главный модуль
 *******************************************************************************/

// Подключение заголовочного файла
#include "main.h"

// Основная функция
int main(void)
{
  // Инициализация системы тактирования микроконтроллера
  CPU_Init();

  // Инициализация линий ввода-вывода для работы с кнопками
  BTN_Init();

  // Инициализация жидкокристаллического дисплея
  LCD_Init();

  // Инициализация сторожевого таймера
  IWDG_Init();

  // Инициализация операционной системы реального времени
  RTOS_Init();
}
